package edu.jose.vazquez.actividades.avanceproyecto.lang;

public class Jap extends Lang{
    public Jap(){
        menu_login="\n╔═══════════════════════════╗\n║           ログイン           ║\n╠═══════════════════════════╣\n║ アカウントを持っていません   ║\n║ 1. 登録                    ║\n║                           ║\n║ すでにアカウントを持っています ║\n║ 2. サインイン               ║\n║                           ║\n║ 3. 終了                    ║\n╚═══════════════════════════╝";
        menu_admin="\n╔═══════════════════════════════════════════════════════════╗\n║                       管理者メニュー                          ║\n╠═══════════════════════════════════════════════════════════╣\n║     1. 図書館に登録されている人を確認する                  ║\n║     2. 図書館に新しい本を追加する                          ║\n║     3. 在庫の本を表示する                                  ║\n║     4. アクティブな貸出を確認する                          ║\n║     5. 終了                                                ║\n╚═══════════════════════════════════════════════════════════╝";
        menu_user="\n╔══════════════════════════════════════════════╗\n║                    メニュー                      ║\n╠══════════════════════════════════════════════╣\n║     1. 利用可能な本を確認する                  ║\n║     2. 本の貸出をリクエストする                ║\n║     3. アクティブな貸出                         ║\n║     4. 終了                                      ║\n╚══════════════════════════════════════════════╝";
        invalid_option="\n╔════════════════════════════════════════════════════════════════════════════╗\n║  無効なオプションです。メニューにない数字は入力できません         ║\n╚════════════════════════════════════════════════════════════════════════════╝";
        username_prompt="\n╔═════════════════════════════════╗\n║ 素晴らしい、ユーザー名を入力してください: ║\n╚═════════════════════════════════╝\n";
        password_prompt="\n╔═══════════════════════════════╗\n║   次にパスワードを入力してください     ║\n╚═══════════════════════════════╝\n";
        welcome_admin="\n╔═══════════════════════════╗\n║  管理者へようこそ    ║\n╚═══════════════════════════╝";
        welcome_user="\n╔═══════════════════════╗\n║  ようこそ ";
        welcome_user_format=" ║\n╚═══════════════════════╝";
        goodbye="\n╔════════════╗\n║  さようなら!  ║\n╚════════════╝";
        register_user="\n╔═══════════════════════════════════╗\n║   登録するためにユーザー名を入力してください    ║\n╚═══════════════════════════════════╝";
        register_password="\n╔═══════════════════════════════════╗\n║     安全なパスワードを入力してください       ║\n╚═══════════════════════════════════╝";
        registration_success="\n╔═════════════════════════════════╗\n║  アカウントが正常に作成されました！  ║\n╚═════════════════════════════════╝";
        invalid_credentials="\n╔═══════════════════════════╗\n║    無効な認証情報    ║\n╚═══════════════════════════╝";
        book_added="\n╔══════════════════════════════════════════╗\n║  本が正常にカタログに追加されました！ ║\n╚══════════════════════════════════════════╝";
        book_borrow_success="\n本の貸出が成功しました";
        book_not_available="\nこの本は利用できません";
        invalid_input_empty = "\n╔═════════════════════════════════════════════════════╗\n║  無効なオプションです。入力を空白にすることはできません   ║\n╚═════════════════════════════════════════════════════╝";
        invalid_input_not_number = "\n╔═══════════════════════════════════════════════════════════╗\n║       無効なオプションです。メニューの番号を入力してください          ║\n╚═══════════════════════════════════════════════════════════╝";
        invalid_option_out_of_range = "\n╔════════════════════════════════════════════════════════════════════════════╗n║    無効なオプションです。メニューにない数字は入力できません       ║\n╚════════════════════════════════════════════════════════════════════════════╝";
        enter_book_title_prompt = "\n╔══════════════════════════════╗\n║ 本のタイトルを入力してください  ║\n╚══════════════════════════════╝\n";
        invalid_title="\n╔═════════════════════════════════════════════════════════╗\n║        本には名前が必要です。もう一度試してください           ║\n╚═════════════════════════════════════════════════════════╝";
        enter_book_author_prompt = "\n╔═══════════════════════════════╗\n║ 本の著者を入力してください  ║\n╚═══════════════════════════════╝\n";
        invalid_author="\n╔════════════════════════════════════════════════════════╗\n║    本には著者が必要です。もう一度試してください。          ║\n╚════════════════════════════════════════════════════════╝";
        enter_book_isbn_prompt = "\n╔═════════════════════════════╗\n║ 本のISBNを入力してください  ║\n╚═════════════════════════════╝\n";
        invalid_isbn="\n╔══════════════════════════════════════════════════════════════╗\n║        本にはISBNコードが必要です。もう一度試してください。           ║\n╚══════════════════════════════════════════════════════════════╝";
        enter_book_genre_prompt = "\n╔══════════════════════════════╗\n║ 本のジャンルを入力してください  ║\n╚══════════════════════════════╝\n";
        invalid_genre="\n╔══════════════════════════════════════════════════════════════════════════╗\n║        本は必ず文学ジャンルに属する必要があります。もう一度試してください。            ║\n╚══════════════════════════════════════════════════════════════════════════╝";
        enter_book_year_prompt = "\n╔════════════════════════════════════╗\n║ 本の出版年を入力してください  ║\n╚════════════════════════════════════╝\n";
        year_of_publication_negative_error = "\n╔══════════════════════════════════════════════════════════════╗\n║        出版年は負の値にはできません。           ║\n╚══════════════════════════════════════════════════════════════╝";
        year_of_publication_future_error = "\n╔══════════════════════════════════════════════════════════════╗\n║        出版年はまだ来ていません。2025年までの有効な年を入力してください。  ║\n╚══════════════════════════════════════════════════════════════╝";
        book_entry_success = "\n╔════════════════════════════════════════╗\n║ 本は利用可能として登録されます  ║\n╚════════════════════════════════════════╝";
        book_borrow_name_prompt = "\n╔═════════════════════════════════════════════════════════╗\n║     借りたい本の名前を入力してください       ║\n╚═════════════════════════════════════════════════════════╝";
        no_active_loans_message = "\n╔════════════════════════════════════════════════╗\n║    あなたが借りている本は以下の通りです       ║\n╚════════════════════════════════════════════════╝";
        no_books_borrowed_message = "\n現在アクティブな貸出はありません";
        show_books_in_catalog_message = "\n╔════════════════════════════════════════════╗\n║  これは現在の本のカタログです      ║\n╚════════════════════════════════════════════╝";               
        number_format_exception = "\n╔══════════════════════════════════════════════════════════════╗\n║        数字のみを入力できます。もう一度試してください。         ║\n╚══════════════════════════════════════════════════════════════╝";
        exit_admin = "\n╔══════════════════════════════════════╗\n║  管理者メニューを終了します      ║\n╚══════════════════════════════════════╝";
        singning_out = "\n╔═══════════════════════════════╗\n║  アカウントからサインアウトします  ║\n╚═══════════════════════════════╝";
        return_to_menu = "\nメニューに戻るにはENTERキーを押してください...";
        invalid_new_username = "\n╔══════════════════════════════════════════════════════════════════════════════════╗\n║          有効なユーザー名を入力してください。空白にすることはできません、もう一度試してください            ║\n╚══════════════════════════════════════════════════════════════════════════════════╝";
        invalid_new_password = "\n╔═══════════════════════════════════════════════════════════════╗\n║     パスワードは空白にできません。もう一度試してください       ║\n╚═══════════════════════════════════════════════════════════════╝";
        registered_people ="\n╔══════════════════════════════════════════════╗\n║ システムに登録されている人々は以下の通りです:     ║\n╚══════════════════════════════════════════════╝";
        show_active_loans ="\nアクティブな貸出を表示しています...";
        select_an_option = "\nオプションを選択してください: ";
        author="著者: ";
        title ="タイトル: ";
        isbn="ISBN: ";
        genre="ジャンル: ";
        year_book="出版年: ";
        username="ユーザー名: ";
        password="パスワード: ";
        
    }
}
